##
# brews
##

## Productive stuff
brew "ack"
brew "httpie"
brew "wget"
brew "packer"
brew "watch"

## Programming stuff
brew "rbenv"
brew "ruby-build"
brew "ngrok"
brew "nvm"
brew "npm"
brew "python"
brew "git"
brew "git-flow"

## Shell stuff
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "tmate"

## VPN stuff
#brew "tuntap"
#brew "openconnect"

## brew "cask and more versions of casks
brew "caskroom/cask/brew-cask"

## Pivotal CF cli
brew "cloudfoundry-cli"

## Time-waste stuff
#brew "fortune"
#brew "cowsay"
brew "youtube-dl"

## Games
brew "homebrew/games/ckan"

##
# taps
##

## brew cask and more versions of casks
tap "caskroom/versions"

## Add tap "for Pivotal
tap "pivotal/tap"

## Tap for packer
tap "homebrew/binary"

## Tap for tmate
tap "nviennot/tmate"

##
# casks
##

## Install a ton of great apps using Homebrew cask instead of downloading, clicking and manually installing :)

## Standard app replacements
# Web
cask "google-chrome"
# cask Terminal
cask "iterm2"

## Boxes
# Virtualization
cask "vagrant"
cask "virtualbox"
# Containers
cask "dockertoolbox"

## Coding
# SourceTree
cask "sourcetree"
# Text editing
cask "sublime-text3"
cask "atom"
# Markdown
cask "macdown"

## Desktop
# Proper screen ligthing
cask "flux"
# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "betterzipql"
cask "suspicious-package"
# Window management
cask "spectacle"
# Logitech Unifying software for keyboard and trackball
cask "logitech-unifying"

## Media
# Video player
cask "vlc"
# PDF reader
cask "skim"
# Picture viewer
cask "xee"
# Comic reader
cask "simple-comic"
# Sonos music manager
cask "sonos"
# Soundcloud client (yes, that's the correct spelling)
cask "soundcleod"
# Adobe Flash
cask "flash"
# Podcast player
cask "instacast"
# Music player - install vox from App Store instead
# Spotify player
cask "spotify"


## Work
# Screen recording
cask "screenflow"
# Note taking
cask "evernote"
cask "nvalt"
# VMware View
cask "vmware-horizon-view-client"
# Collaboration
cask "slack"
# Podcast cleanup
cask "levelator"
cask "audio-hijack"

## Cloud resources
cask "google-cloud-sdk"

## Social
# Skype
cask "skype"

## Storage
# Online storage
cask "dropbox"
cask "google-drive"
# Compression
cask "keka"
# Management
cask "filezilla"

## Games
# Steam client - now possible to stream games from the gaming rig to the Mac!
cask "steam"
